[
  {
    "title": "Kamistyles E-Commerce Platform",
    "description": "Full-stack e-commerce application with complete shopping and payment experience. Built product management system handling 200+ products with advanced search, filtering, and sorting capabilities. Integrated Stripe and Paystack payment processing with webhook handlers for automated order confirmation. Optimized for performance with server-side rendering achieving 95+ Lighthouse score.",
    "image": "/modern-ecommerce-interface.png",
    "tech": ["Next.js", "TypeScript", "PostgreSQL", "Stripe", "Paystack", "Tailwind CSS"],
    "github": "https://github.com/D-honoured1/Kamistyles",
    "demo": "https://kami-styles.vercel.app"
  },
  {
    "title": "Drive Clone – Cloud Storage System",
    "description": "Personal cloud storage application with secure file management and sharing. Engineered RESTful API for file operations including upload, download, organization, and deletion. Implemented JWT-based authentication and role-based access control with Supabase. Designed PostgreSQL schema with hierarchical folder structure and optimized queries for fast retrieval.",
    "image": "/file-storage-cloud-drive-interface.jpg",
    "tech": ["Node.js", "Express.js", "PostgreSQL", "Prisma ORM", "JWT", "Supabase"],
    "github": "https://github.com/D-Honoured1/drive",
    "demo": null
  },
  {
    "title": "Content Management System",
    "description": "Production CMS with hierarchical article management and workflow. Implemented self-referential database relationships for parent-child article hierarchy. Created collapsible tree navigation with authentication and status workflow management (draft/published/archived). Added auto-save functionality and dark mode with localStorage persistence.",
    "image": "/cms-dashboard.png",
    "tech": ["Remix", "React", "TypeScript", "Prisma", "PostgreSQL", "Supabase Auth"],
    "github": "https://github.com/D-Honoured1/CMS",
    "demo": "https://cms-flax-sigma.vercel.app"
  },
  {
    "title": "Kamisoft SaaS Platform",
    "description": "Architected SaaS platform with microservices backend achieving 99.9% uptime. Optimized database schemas reducing query response times by 40%. Implemented CI/CD pipelines using GitHub Actions for automated testing and deployment. Configured serverless functions for event-driven workflows and background processing tasks.",
    "image": "/modern-saas-dashboard.png",
    "tech": ["Next.js", "TypeScript", "Node.js", "Express.js", "PostgreSQL", "Prisma", "Docker", "CI/CD"],
    "github": "https://github.com/D-honoured1/Kamisoft",
    "demo": "https://kamisoftenterprises.online"
  }
]
